{"pages":[{"title":"about","text":"안녕하세요.종민짱입니다. 연락은 jongminzzang97@gmail.com로 부탁드립니다.몇 시간내에 확인합니다.","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/08/08/hello-world/"},{"title":"Hi, blog start!","text":"블로그 개설!!시작드디어 블로그를 만들었다. 마음처럼 블로그를 만드는 것이 쉽지않았다. using hexo네이버 블로그는 컴퓨터 분야와 잘 맞지 않는다고 생각했고, 티스토리는 최근에 서버상태가 좋지 않은 지 속도가 좀 느리고 이용률도 낮아지고 있다고 생각해서 github pages를 이용해서 블로그를 만들기로 마음을 먹었다. github pages를 이용하여 블로그를 만드는 방법은 1. 직접 코딩 2. jekyll을 이용 3. hexo를 이용이 대표적이인데 지금 이 블로그는 hexo icarus theme을 이용하여 생성한 블로그이다. 일단 jekyll이나 hexo는 조금의 차이는 있지만 다른 사람이 만들어 놓은 테마를 이용하면 되기에 매우 편리하다. 또한 post를 markdown으로 작성하기에 내가 md파일을 저장하고 있을 수 있다는 것이 큰 장점이라고 할 수 있다.(나중에 블로그의 테마를 바꾸거나, 프레임워크를 쉽게 바꿀 수 있다.)뭐 직접 만드는 것은 원하는 데로 만들 수 있다는 것이 장점이지만 당연히 하기가 힘들다. 그래서 직접만들 생각은 없었고 jekyll을 이용하고자 하였다. 그리고 뭐 어렵지 않게 만들 수 있었다. 근데 자꾸 사소한 오류가 발생하거나 조금씩 마음에 들지 않는 부분이 있어서 처음부터 만들어야겠다고 웹공부를 조금 했는데, 또 그러기에는 양이 너무 많을 것 같아 hexo를 이용한 마음에 드는 theme을 찾아서 시도하게 되었다. 결과적으로 jekyll, hexo 둘을 통해 블로그를 만들어보면서 조금의 차이점을 찾았다.jekyll은 그냥 markdown으로 작성한 파일을 github에 push하기만 하면 된다. 즉 내가 local에서 작업하는 파일, 폴더 그대로 github에 있다.반면 hexo는 generate, deploy 명령어를 이용한다. github에 내가 작업한 폴더가 그대로 올라가는 것이 아니라 작업한 폴더를 이용해 웹을 생성하고 그 웹을 업로드하는 것 같다. (generate과정에서 markdown파일이 html로 변환된 파일이 생성된다.) 그리고 config.yml의 정보또한 generate과정에 이용되어 github에 upload되지 않는다. 블로그를 만들면서 참고한 것기본적으로는 유튜브 영상을 보면서 따라했고, 밑의 블로그의 글도 정말 도움도 많이 받았다. 카인드페밀리 - 오늘 부터 나도 github.io 블로그 운영자다!! | github pages , goormide, hexo 멋진 깃허브 블로그 시작하기","link":"/2021/08/09/hi/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"}],"categories":[{"name":"blog","slug":"blog","link":"/categories/blog/"}]}